## Staging: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.temporary_token_generated_outside_canada_warn must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "temporary_token_generated_outside_canada_warn" {
      ~ alarm_name                            = "TemporaryTokenGeneratedOutsideCandaWarn" -> "TemporaryTokenGeneratedOutsideCanadaWarn" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TemporaryTokenGeneratedOutsideCandaWarn" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          + "Region" = "ca-central-1"
          + "Rule"   = "TemporaryTokenGeneratedOutsideCanada"
          + "WebACL" = "GCForms"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "TemporaryTokenGeneratedOutsideCandaWarn" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      ~ metric_name                           = "TemporaryTokenGeneratedOutsideCanada" -> "CountedRequests"
      ~ namespace                             = "forms" -> "AWS/WAFV2"
        tags                                  = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]

10 tests, 8 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
